#+title: Some tools

This repo collects tools I use, most of which I've written, and installs them in one lump.  The tools fall into these categories:

- Shell (usually bash) scripts (under [[file:scripts/]])
- Python modules with CLI entry points directly implemented in this package.
- Python CLI entry points from their own packages added as dependencies.

Use of this package is intended just for me but others are free to use it according to its [[file:LICENSE][GPLv3+]] licensing.  

* Install

#+begin_center
Beware, this package has nothing to do with the [[https://pypi.org/project/tools/]["tools" package on PyPI]].
#+end_center

As an end-user:
#+begin_example
uv tool install git+https://github.com/brettviren/tools
uv tool upgrade tools
#+end_example

As a developer:
#+begin_example
git clone git@github.com:brettviren/tools.git
cd tools
uv tools install -e .
uv tools install -e --upgrade --force
uv run tools [...]
#+end_example

* Basic use


Install man pages and completions

#+begin_example
$ tools manpages     # May need to add to your MANPATH
$ tools completions  # Tested on fish, your shell mileage may vary
#+end_example

Each tool has help (=-h/--help= options) and a summary of all tools is available:

#+begin_src bash :results output :wrap example
uv run tools summary
#+end_src

#+RESULTS:
#+begin_example
tools                   Manage the tools package: import scripts, generate completions and man pages.
clones                  Manage git repository clones across local and remote hosts.
manycron                Manage crontab fragments across many accounts.
time-entry              Monthly time allocator for fiscal-year project reporting.
claude-status           [missing]
cmake-examine           Examine CMake-based source packages without modifying them.
ampersand               Set display background with an image
miageru                 Add your description here 
myougiden               A Japanese/English dictionary for the command line.
updatedb-myougiden      A Japanese/English dictionary for the command line.
barpyrus                A python wrapper for lemonbar/conky
titome                  Add your description here 
herbie                  Add your description here 
rephile                 CLI and Python modules to organize files, particularly photos using git-annex for storage
promnesia               Enhancement of your browsing history
wcpy                    the "new" unified, all-in-one wirecell command 
wirecell                alias of wcpy, matching the package name 
wirecell-sigproc        legacy per-module wirecell command: sigproc 
wirecell-util           legacy per-module wirecell command: util 
wirecell-gen            legacy per-module wirecell command: gen 
wirecell-pgraph         legacy per-module wirecell command: pgraph 
wirecell-resp           legacy per-module wirecell command: resp 
wirecell-plot           legacy per-module wirecell command: plot 
wirecell-aux            legacy per-module wirecell command: aux 
wirecell-ls4gan         legacy per-module wirecell command: ls4gan 
wirecell-validate       legacy per-module wirecell command: validate 
wirecell-img            legacy per-module wirecell command: img 
wirecell-test           legacy per-module wirecell command: test 
wirecell-bee            legacy per-module wirecell command: bee 
wirecell-dnn            legacy per-module wirecell command: dnn (needs the torch extra) 
wirecell-pytorch        legacy per-module wirecell command: pytorch (needs the torch extra) 
dune-people             Command line access and cache of DUNE CollabDB
wget-spider             Crawl URLs and store the URLs found for later lookup
imp                     There are many screenshot programs and this one is mine.
passdb                  Add your description here 
wormhole                Securely transfer data between computers
magic-wormhole          Securely transfer data between computers
beet                    music tagger and library organizer
kfz                     kitty split fuzzy file browser with icat/batcat preview
claude-context-settings  merge Claude Code settings from ~/.claude up through the current directory
down                    Search for files or content using fzf-powered selection.
bee                     Upload data to the BEE event-visualization server
kitty-agent-title       [missing]
bwrap-cwd               Run a command inside bwrap with only the CWD and select paths writable.
#+end_example


* Auto-reinstall on pull

When developing across several clones (see the =clones= tool), each clone needs
=uv tool install -e . --upgrade --force= re-run after a pull to expose new or
changed tools on =$PATH=.  This repo ships git hooks under =.githooks/= that do
this automatically after a pull touches =pyproject.toml=, =uv.lock= or =src/=.

The hooks are version-controlled, but enabling them sets =core.hooksPath=, which
is per-clone local config and cannot itself be tracked.  Enable them once:

#+begin_example
$ scripts/install-hooks here   # this clone
$ scripts/install-hooks all    # every clone in this package's clones group
#+end_example

=install-hooks all= must be run from within a clone of this package: it fans
out via =clones run git config core.hooksPath .githooks=, letting =clones=
infer the group from the current directory so it only touches sibling clones of
this package — not every configured group (many of which are not Python
packages).  Running that =clones run= line directly is equivalent.

Note: the hooks also fire on the remote side during =clones sync= (which pulls
over ssh).  If =uv= is not on the non-interactive =$PATH= there, the hook prints
a notice and skips; adjust the =PATH= fallback in =.githooks/_install= if your
=uv= lives outside =~/.local/bin=.

